{
  "name": "ConditionTracker",
  "script": "ConditionTracker.js",
  "version": "1.0",
  "previousversions": [],
  "description": "# ConditionTracker\rThank you for installing ConditionTracker! To suggest features or to report bugs, please create an issue at my [Roll20 scripts repo](https://github.com/thatblindgeye/roll20_scripts).\rThe purpose of this script is to streamline adding conditions to tokens and tracking which conditions are currently affecting a token.\rThis script utilizes token tooltips as the primary way of tracking conditions, so it's best to not already be using tooltips for other purposes. Enabling tooltips on tokens is optional, though recommended for users who may not be able to easily identify token markers.\rToken markers are also utilized as an additional way to track conditions.\r## ConditionTracker State\rWhen this script is installed for the first time, ConditionTracker will be added to your campaign's state object and a character named 'ConditionTracker Config' will be created in your campaign. The existence of the ConditionTracker Config character will be checked on each subsequent load of the game, adding it back in if it no longer exists.\rWhen a new version of ConditionTracker is installed, the state and ConditionTracker Config character will be updated **without** overwriting any customizations made by you. This is done on purpose to avoid you having to add back in your customizations with each update. Keep in mind that this may change if any additional features are added.\rThe basic structure of ConditionTracker state is as follows:\r\r- **Version**: The current version of ConditionTracker. This is used to check whether the currently installed version is up to date, and to update it if not.- **Conditions**: An array of condition objects that can be customized via the ConditionTracker Config character bio (see the ConditionTracker Config section for more information). By default the condition objects are common conditions or statuses found in D&D 5e.\r  You do not need to customize the conditions state in order to add or remove a condition to a token. The conditions state simply allows for storing condition information across game sessions, quickly referencing condition descriptions, and linking token markers to specific conditions.\r  Each condition object is comprised of the following properties:\r\r  - `conditionName` (_string_): The name that will be used by various commands.  - `markerName` (_string_ or _null_): Can link the condition to a token marker in your campaign's token marker set. 'null' is reserved for when you do not wish to link a condition to a token marker.  - `description` (_array of strings_): An optional array that describes the condition in more detail, such as any effects that apply.\r- **Config**: An object where the ConditionTracker Config character ID is stored, as well as the contents of each 'tab' in the character's bio and which tab is currently active.\r## Basic Syntax\rIn order to use a ConditionTracker command, you must use the following syntax:\r`!ct <keyword>|<options>|<optional modifier>`\r\r- **`!ct`**: This must preface a ConditionTracker command in order to call it. This helps avoid name collisions with other installed scripts that may have similarly named commands.- **`<keyword>`** This is the primary command keyword which determines what command will be called. If a proper keyword is not passed in, or if a player does not have permission to use a command, an error message will be sent to chat.- **`<options>`** This is what gets passed to the command. The format or limitation of options that can be passed in will depend on the command being called.- **`<optional modifier>`** This will modify the command in some way. If a modifier is not passed in, the command will be called with its default behavior.\rWhen using a command, generally letter case is not important. Sending `!CT aDd|bLIndED` would be as valid as `!ct add|blinded`.\r## Commands List\rThe following commands are available for use. Most commands are setup so that only the GM has permission to call them.\r### Help\r`!ct help|&#60;optional comma separated list of command names&#62;`, e.g. `!ct help|add, remove`\rThis will display a table of ConditionTracker commands in chat. The table includes the command keyword, a description of the command, the proper syntax, and any modifiers for the command.\rWhen at least one valid command name is passed in as an option, only the specified commands will be sent to chat.\r### Reset\r`!ct reset`\rThis will reset the ConditionTracker state to the default state for the currently installed version. **Running this command will overwrite any customizations made to the ConditionTracker state, and the reset cannot be undone**. This command should be ran if there is an irreversible issue caused from editing the ConditionTracker Config bio, or if you simply want to revert the ConditionTracker state to its default.\rThe first time this command is called, you will be asked to confirm the reset by calling `!ct help|confirm` or cancel the reset by calling `!ct reset|cancel`. Unless the reset is confirmed, the reset will not occur. This is done as a safety precaution to ensure a reset is not made in error.\r### Markers\r`!ct markers|&#60;optional comma separated list of strings&#62;`, e.g. `!ct markers|bli, dea`\rThis will send to chat a table that lists the token markers currently available in the campaign. The table includes the token marker image and the token name. The token name that gets output is the name that must be used when customizing a condition's marker in the ConditionTracker Config character bio.\rThe options passed into this command act as filters, and do not need to exactly match any token marker name. For example, `!ct markers|bli, dea` would return any token markers with 'bli' or 'dea' in their name, such as 'blinded', 'deafened', or 'dead'.\r### Add\r`!ct add|<comma separated list of conditions>`, e.g. `!ct add|blinded, deafened`\rThis will cumulatively add the specified condition(s) to the selected token(s) tooltip. If a condition has a linked token marker, the token marker will also be cumulatively applied to the token.\rIf a token already has a specified condition/token marker applied to it, another instance will be applied. For example, if Cas the Elf currently has the 'blinded' condition and token marker applied to them, calling `!ct add|blinded` will cause Cas the Elf to have two 'blinded' token markers, and their tooltip will be set to 'Blinded, Blinded'.\r### Remove\r`!ct remove|<comma separated list of conditions>`, e.g. `!ct remove|blinded, deafened`\rBy default, this will remove all instances of the specified condition(s) from the selected token(s) tooltip. If a condition has a linked token marker, all instances of that token marker will also be removed from the token.\rIf no options are passed in, all conditions will be removed from the token's tooltip and any linked token markers will also be removed.\r#### Modifiers\r**single** (`!ct remove|<comma separated list of conditions>|single`): This will only remove a single instance of the specified condition(s) from the selected token(s) tooltip. If a condition has a linked token marker, only a single instance of that token marker will be removed.\r### Toggle\r`!ct toggle|<comma separated list of conditions>`, e.g. `!ct toggle|blinded, deafened`\rThis will toggle the specified condition(s) on the selected token(s). If the token currently has a specified condition then the condition will be removed, otherwise the condition will be added. Any linked token markers will be toggled similarly.\r### Conditions\r`!ct conditions|<optional comma separated list of conditions>`\rThis will send to chat a list of conditions and their descriptions depending on how the command is called. If one or more tokens are selected, any conditions affecting the selected tokens will be sent to chat. If no tokens are selected, all conditions currently set in the `ConditionTracker.conditions` state will be sent to chat.\rIf any conditions are passed in as options to the command, e.g. `!ct conditions|blinded, deafened`, the specified conditions will be sent to chat. This is the default behavior when options are passed in, even if a token is selected.\r## ConditionTracker Config\rThe ConditionTracker Config character bio consists of an 'instructions' tab and a 'conditions' tab. The instructions tab includes the same information that follows, and the conditions tab is where you can customize the `ConditionTracker.conditions` state via a conditions table.\r### Editing the Conditions Table\rWhen editing this conditions table, it is important to ensure the table remains intact and that the table layout is not altered.\r#### Condition column\rCells in this column refer to a condition's `conditionName` property in state. Each condition name must be a simple string, and must be unique regardless of letter case. For example, `blinded` (all lowercase) and `Blinded` (capitalized first letter) would not be unique condition names. However the condition name is formatted here is how it will appear when rendered on a token's tooltip or when sent as a condition card in chat.\rWhen condition names are attempted to be saved, there are several checks that occur to ensure the condition name is valid. If a condition name is not valid, it is reformatted to become valid so that information entered by users is not lost. The checks that occur include:\r\r- Any vertical pipes `|` are removed- Extraneous whitespace is trimmed from the condition name, including the middle (only a single whitespace is allowed between characters)- Empty strings are replaced with a condition name of 'Condition' + a unique number identifier- If the condition name already exists, a unique number identifier is appended to the condition name\rAfter all checks are finished, the conditions table is sorted alphabetically by condition name, ignoring letter case.\r#### Marker column\rCells in this column refer to a condition's `markerName` property in state, linking a valid associated marker in your campaign's current token marker set to the condition. Each marker name must be either a simple string, or the word 'null'.\rMarker names in this column must match a token marker name exactly, including letter case and hyphens `-` or underscores `_`. If not entered correctly, a token marker will not be linked to the condition correctly, and the marker image will not be applied to tokens when using ConditionTracker commands.\rWhen 'null' is entered for a marker name, it will not set the `markerName` property to a string, but instead the `null` data type. Due to this, it is best to avoid using 'null' as a marker name in your custom token marker sets.\r#### Description column\rCells in this column refer to a condition's `description` property in state. Each description must be an ordered or unordered list, with each list item acting as a separate description item or effect for the condition. Nested lists are not supported, but you can add simple font styles such as bold, italic, underline, strikethrough, and font color. You can also add 'buttons' that will call a specific condition card by wrapping text in a link, and passing in the `!ct conditions|<condition name>` command as the link's URL. When creating a button that calls another condition card, you must use the 'Link' button in the ConditionTracker Config bio editor.",
  "authors": "thatblindgeye",
  "roll20userid": "67635",
  "useroptions": [],
  "dependencies": [],
  "modifies": {
    "state.ConditionTracker": "read,write",
    "campaign.token_markers": "read",
    "token.statusmarkers": "read,write",
    "token.tooltip": "read,write",
    "chat": "read,write"
  },
  "conflicts": []
}
